Revit 2026 API

# STEPExportOptions Class

---

The export options used by exporting STEP format file.

SystemObject Autodesk.Revit.DBBIMExportOptions Autodesk.Revit.DBSTEPExportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class STEPExportOptions : BIMExportOptions
```
```vb
Public Class STEPExportOptions
	Inherits BIMExportOptions
```
```cpp
public ref class STEPExportOptions : public BIMExportOptions
```
```fsharp
type STEPExportOptions =
    class
        inherit BIMExportOptions
    end
```

The STEPExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | STEPExportOptions | Constructs a new instance of STEPExportOptions with default values of all properties. |

|  | Name | Description |
| --- | --- | --- |
|  | ApplicationProtocol | The Application Protocol of the exported STEP file. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from BIMExportOptions) |
|  | TargetUnit | The unit type of geometry in the resultant STEP file. Default value is ExportUnit::Default. |
|  | ViewId | The element id of the 3D view to export. InvalidElementId by default. (Inherited from BIMExportOptions) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from BIMExportOptions) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace